#Савченко Ольга, 91 группа, 2 курс
#6. Класс «Бог» с полями «имя», «стихия». Декоратор, который помимо действия
#метода, выводит «Вы осмелились потревожить имя_бога». Декорировать им все методы
#(кроме геттера имени). Добавить метод «выслушать молитву», который принимает
#строку и ничего с ней не делает.

import module_God # подключаем модуль, содержащий структуру God
##########################################################################################
def change_name(god,f):#функция изменения имени
    print("Введите новое имя Бога: ")
    name = input()
    god.name = name
    print("-------------------------------")
    print(god)
    print("-------------------------------")
    print("Записать в файл?(y/Y-да)")
    choice=input()
    if choice=='y'or choice=='Y':
        f.writelines('\n' + "Вы изменили имя Бога\n" + god.__str__())
        print("Вы сделали запись в файл")
    print("-------------------------------")

##########################################################################################
def change_element(god,f):#функция изменения стихии
    print("Введите новую стихию Бога: ")
    element = input()
    god.element = element
    print("-------------------------------")
    print(god)
    print("-------------------------------")
    print("Записать в файл?(y/Y-да)")
    choice = input()
    if choice == 'y'or choice=='Y':
        f.writelines('\n' + "Вы изменили стихию Бога\n" + god.__str__())
        print("Вы сделали запись в файл")
    print("-------------------------------")

##########################################################################################
def listen_to_prayer1(god,f):#функция выслушать молитву
    print("Введите молитву:")
    prayer = input()
    print("-------------------------------")
    god.listen_to_prayer(prayer)
    print(god.name, " выслушал молитву")
    print("-------------------------------")
    print("Записать в файл?(y/Y-да)")
    choice = input()
    if choice == 'y'or choice=='Y':
        f.writelines('\n' + "Вы выслушали молитву" + '\n')
        print("Вы сделали запись в файл")
    print("-------------------------------")

##########################################################################################
def delete(f):#функция удаления Бога
    print("-------------------------------")
    print("Вы удалили Бога")
    print("-------------------------------")
    print("Записать в файл?(y/Y-да)")
    choice = input()
    if choice == 'y'or choice=='Y':
        f.writelines('\n' + "Вы удалили Бога"+"\n")
        print("Вы сделали запись в файл")
    print("-------------------------------")

##########################################################################################
def menu2_(god, f):
    menu2=0
    while menu2 != 5:
        print("1.Изменить имя Бога\n2.Изменить стихию Бога\n"
              "3.Выслушать молитву\n4.Удалить Бога\n5.Вернуться в меню\n")
        menu2 = input()
        match menu2:
            case "1":
                change_name(god, f)
            case "2":
                change_element(god, f)
            case "3":
                listen_to_prayer1(god, f)
            case "4":
                delete(f)
                del god
                menu2=5
            case "5":
                break
            case _:
                print("Неверные данные\n")

##########################################################################################
def menu_2_file(f):#функция меню выбора действий с Богом при работе с файлом
    f1 = open("data.txt", 'r', encoding="UTF-8")
    name = f1.readline()
    name = name.rstrip("\n")
    element = f1.readline()
    element = element.rstrip("\n")
    god = module_God.God(name, element)
    print("-------------------------------")
    f.writelines('\n' + god.__str__())
    print("-------------------------------")
    menu2_(god,f)
    f1.close()

##########################################################################################
def menu_2_ne_file(f):#функция меню выбора действий с Богом при работе с консолью
    print("Введите имя Бога: ")
    name = input()
    print("Введите стихию Бога: ")
    element = input()
    god = module_God.God(name, element)
    print("-------------------------------")
    print(god)
    print("-------------------------------")
    menu2_(god,f)


##########################################################################################
def menu_1(f):#функция выбора работы с файлом или с консолью
    print("1.Ввод из файла\n2.Ввод с консоли\n")
    menu1 = input()
    match menu1:
        case "1":
            menu_2_file(f)
        case "2":
            menu_2_ne_file(f)
        case _:
            print("Неверные данные\n")



###########################################################################################
menu=0
f = open("out.txt", 'w', encoding="UTF-8")
while menu!=2:#основное меню
    print("1.Создать Бога\n2.Завершить работу")
    menu=input()
    match menu:
        case "1":
            menu_1(f)
        case "2":
            break
        case _:
            print("Неверные данные\n")
f.close()